Rbb666/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_RetroGo/applications/retro_go/platform/retro_go_audio_pdl.c
#include "retro_go_audio.h"

#include "retro_go_platform.h"

#include "cy_pdl.h"
#include "cybsp.h"
#include "drv_es8388.h"

#include <rtthread.h>

#include <string.h>

#define RETRO_GO_AUDIO_RING_SAMPLES 8192u
#define RETRO_GO_AUDIO_RING_MASK (RETRO_GO_AUDIO_RING_SAMPLES - 1u)
#define RETRO_GO_AUDIO_RATE 16000u
#define RETRO_GO_AUDIO_INPUT_CHANNELS 1u
#define RETRO_GO_AUDIO_SAMPLE_BITS 16u
#define RETRO_GO_AUDIO_Q16_ONE 65536u
#define RETRO_GO_TDM_FIFO_MONO_FRAMES 32u
#define RETRO_GO_TDM_STARTUP_MONO_FRAMES 64u
#define RETRO_GO_WSOLA_OUTPUT_RING_SAMPLES 4096u
#define RETRO_GO_WSOLA_OUTPUT_RING_MASK \
    (RETRO_GO_WSOLA_OUTPUT_RING_SAMPLES - 1u)
#ifndef BSP_RETRO_GO_AUDIO_WSOLA_GRAIN_SAMPLES
#define BSP_RETRO_GO_AUDIO_WSOLA_GRAIN_SAMPLES 512
#endif
#ifndef BSP_RETRO_GO_AUDIO_WSOLA_SEARCH_SAMPLES
#define BSP_RETRO_GO_AUDIO_WSOLA_SEARCH_SAMPLES 96
#endif
#define RETRO_GO_WSOLA_GRAIN_SAMPLES \
    ((uint32_t)BSP_RETRO_GO_AUDIO_WSOLA_GRAIN_SAMPLES)
#define RETRO_GO_WSOLA_HOP_SAMPLES \
    (RETRO_GO_WSOLA_GRAIN_SAMPLES / 2u)
#define RETRO_GO_WSOLA_SEARCH_SAMPLES \
    ((uint32_t)BSP_RETRO_GO_AUDIO_WSOLA_SEARCH_SAMPLES)
#define RETRO_GO_WSOLA_SCORE_STRIDE 2u

#ifndef BSP_RETRO_GO_AUDIO_OUTPUT_TARGET_SAMPLES
#define BSP_RETRO_GO_AUDIO_OUTPUT_TARGET_SAMPLES 3584
#endif

#ifndef BSP_RETRO_GO_AUDIO_BUFFER_CORRECTION_PERCENT
#define BSP_RETRO_GO_AUDIO_BUFFER_CORRECTION_PERCENT 12
#endif

#ifndef BSP_RETRO_GO_AUDIO_PREROLL_SAMPLES
#define BSP_RETRO_GO_AUDIO_PREROLL_SAMPLES 2048
#endif

#ifndef BSP_RETRO_GO_AUDIO_TARGET_SAMPLES
#define BSP_RETRO_GO_AUDIO_TARGET_SAMPLES 1536
#endif

#ifndef BSP_RETRO_GO_AUDIO_MIN_SPEED_PERCENT
#define BSP_RETRO_GO_AUDIO_MIN_SPEED_PERCENT 25
#endif

#ifndef BSP_RETRO_GO_AUDIO_RATE_WINDOW_MS
#define BSP_RETRO_GO_AUDIO_RATE_WINDOW_MS 250
#endif

#ifndef BSP_RETRO_GO_AUDIO_STARTUP_RATE_WINDOW_MS
#define BSP_RETRO_GO_AUDIO_STARTUP_RATE_WINDOW_MS 50
#endif

#ifndef BSP_RETRO_GO_AUDIO_CONCEAL_FADE_MS
#define BSP_RETRO_GO_AUDIO_CONCEAL_FADE_MS 10
#endif

#if (RETRO_GO_AUDIO_RING_SAMPLES & RETRO_GO_AUDIO_RING_MASK) != 0
#error "Retro-Go PDL audio ring must be a power of two"
#endif
#if BSP_RETRO_GO_AUDIO_PREROLL_SAMPLES > RETRO_GO_AUDIO_RING_SAMPLES
#error "Retro-Go PDL audio preroll must fit the source ring"
#endif
#if RETRO_GO_AUDIO_INPUT_CHANNELS != 1u || RETRO_GO_AUDIO_SAMPLE_BITS != 16u
#error "Retro-Go PDL backend accepts only one channel of signed 16-bit PCM"
#endif
#if (RETRO_GO_WSOLA_OUTPUT_RING_SAMPLES & \
     RETRO_GO_WSOLA_OUTPUT_RING_MASK) != 0
#error "Retro-Go WSOLA output ring must be a power of two"
#endif
#if BSP_RETRO_GO_AUDIO_PREROLL_SAMPLES > \
    RETRO_GO_WSOLA_OUTPUT_RING_SAMPLES
#error "Retro-Go audio preroll must fit the WSOLA output ring"
#endif
#if BSP_RETRO_GO_AUDIO_OUTPUT_TARGET_SAMPLES > \
    RETRO_GO_WSOLA_OUTPUT_RING_SAMPLES
#error "Retro-Go WSOLA target must fit the output ring"
#endif
#if (BSP_RETRO_GO_AUDIO_WSOLA_GRAIN_SAMPLES & 1) != 0 || \
    BSP_RETRO_GO_AUDIO_WSOLA_GRAIN_SAMPLES < 256 || \
    BSP_RETRO_GO_AUDIO_WSOLA_GRAIN_SAMPLES > 1024
#error "Retro-Go WSOLA grain must be an even value from 256 to 1024"
#endif
#if BSP_RETRO_GO_AUDIO_WSOLA_SEARCH_SAMPLES >= \
    (BSP_RETRO_GO_AUDIO_WSOLA_GRAIN_SAMPLES / 2)
#error "Retro-Go WSOLA search must be smaller than the synthesis hop"
#endif

typedef struct audio_continuity_state
{
    uint32_t phase_q16;
    uint32_t step_q16;
    uint32_t feedforward_q16;
    uint32_t control_started_ms;
    uint32_t control_source_index;
    uint32_t control_output_index;
    uint32_t input_rate_hz;
    uint32_t output_rate_hz;
    uint32_t concealed_samples;
    uint32_t underrun_events;
    int32_t gain_q15;
    int16_t last_source_sample;
    bool measured;
    bool starving;
} audio_continuity_state_t;

typedef struct audio_wsola_state
{
    uint64_t source_position_q16;
    uint32_t current_start;
    uint32_t next_start;
    uint16_t hop_position;
    bool initialized;
    bool first_hop;
    bool next_ready;
    int16_t current_grain[RETRO_GO_WSOLA_GRAIN_SAMPLES];
    int16_t next_grain[RETRO_GO_WSOLA_GRAIN_SAMPLES];
} audio_wsola_state_t;

static int16_t audio_ring[RETRO_GO_AUDIO_RING_SAMPLES] RETRO_GO_SOCMEM;
static audio_continuity_state_t continuity RETRO_GO_SOCMEM;
#ifdef BSP_RETRO_GO_AUDIO_WSOLA
static int16_t wsola_output_ring[RETRO_GO_WSOLA_OUTPUT_RING_SAMPLES]
    RETRO_GO_SOCMEM;
static audio_wsola_state_t wsola RETRO_GO_SOCMEM;
static volatile uint32_t wsola_output_write_index;
static volatile uint32_t wsola_output_read_index;
#endif
static volatile uint32_t audio_write_index;
static volatile uint32_t audio_read_index;
static volatile uint32_t audio_source_index;
static volatile uint32_t audio_output_index;
static volatile uint32_t audio_hardware_underflows;
static volatile bool audio_ready;
static volatile bool audio_playback_started;
static volatile bool audio_hw_running;
static bool audio_overflow_reported;
static cy_stc_tdm_config_tx_t pdl_tdm_tx_config;
static cy_stc_tdm_config_t pdl_tdm_config;

static uint32_t continuity_min_step_q16(void)
{
    return (uint32_t)BSP_RETRO_GO_AUDIO_MIN_SPEED_PERCENT *
           RETRO_GO_AUDIO_Q16_ONE / 100u;
}

static void continuity_update_control(void)
{
    uint32_t now_ms = rt_tick_get_millisecond();
    uint32_t elapsed_ms = now_ms - continuity.control_started_ms;
    uint32_t measurement_window_ms = continuity.measured ?
        (uint32_t)BSP_RETRO_GO_AUDIO_RATE_WINDOW_MS :
        (uint32_t)BSP_RETRO_GO_AUDIO_STARTUP_RATE_WINDOW_MS;
    uint32_t available = audio_write_index - audio_read_index;
    bool first_measurement = false;
    int32_t error;
    int32_t correction_q16;
    int32_t desired_q16;
    const uint32_t maximum_step_q16 = RETRO_GO_AUDIO_Q16_ONE;
    const int32_t correction_limit_q16 =
        (int32_t)(RETRO_GO_AUDIO_Q16_ONE *
                  BSP_RETRO_GO_AUDIO_BUFFER_CORRECTION_PERCENT / 100u);

    if (elapsed_ms >= measurement_window_ms)
    {
        uint32_t source_index = audio_source_index;
        uint32_t output_index = audio_output_index;
        uint32_t source_delta =
            source_index - continuity.control_source_index;
        uint32_t output_delta =
            output_index - continuity.control_output_index;
        uint32_t source_rate = source_delta * 1000u / elapsed_ms;
        uint32_t output_rate = output_delta * 1000u / elapsed_ms;
        uint32_t measured_q16 = output_delta != 0u ?
            (uint32_t)(((uint64_t)source_delta << 16u) / output_delta) :
            (uint32_t)(((uint64_t)source_rate << 16u) /
                       RETRO_GO_AUDIO_RATE);

        if (measured_q16 > maximum_step_q16)
        {
            measured_q16 = maximum_step_q16;
        }
        first_measurement = !continuity.measured;
        if (first_measurement)
        {
            continuity.feedforward_q16 = measured_q16;
        }
        else if (measured_q16 < continuity.feedforward_q16)
        {
            continuity.feedforward_q16 = (uint32_t)(
                (int32_t)continuity.feedforward_q16 +
                ((int32_t)measured_q16 -
                 (int32_t)continuity.feedforward_q16) / 2);
        }
        else
        {
            continuity.feedforward_q16 = (uint32_t)(
                (int32_t)continuity.feedforward_q16 +
                ((int32_t)measured_q16 -
                 (int32_t)continuity.feedforward_q16) / 4);
        }
        continuity.measured = true;
        continuity.input_rate_hz = source_rate;
        continuity.output_rate_hz = output_rate;
        continuity.control_started_ms = now_ms;
        continuity.control_source_index = source_index;
        continuity.control_output_index = output_index;
    }

#ifndef BSP_RETRO_GO_AUDIO_VARISPEED
    continuity.feedforward_q16 = RETRO_GO_AUDIO_Q16_ONE;
    continuity.step_q16 = RETRO_GO_AUDIO_Q16_ONE;
    return;
#endif

