Rbb666/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_RetroGo/applications/retro_go/platform/retro_go_audio_pdl.c
    error = (int32_t)available -
            (int32_t)BSP_RETRO_GO_AUDIO_TARGET_SAMPLES;
    correction_q16 = (int32_t)(((int64_t)error *
        correction_limit_q16) /
        (int32_t)BSP_RETRO_GO_AUDIO_TARGET_SAMPLES);
    if (correction_q16 < -correction_limit_q16)
    {
        correction_q16 = -correction_limit_q16;
    }
    if (correction_q16 > correction_limit_q16)
    {
        correction_q16 = correction_limit_q16;
    }
    desired_q16 = (int32_t)continuity.feedforward_q16 + correction_q16;
    if (desired_q16 < (int32_t)continuity_min_step_q16())
    {
        desired_q16 = (int32_t)continuity_min_step_q16();
    }
    if (desired_q16 > (int32_t)maximum_step_q16)
    {
        desired_q16 = (int32_t)maximum_step_q16;
    }
    if (first_measurement ||
        (available < RETRO_GO_TDM_FIFO_MONO_FRAMES * 2u &&
         (uint32_t)desired_q16 < continuity.step_q16))
    {
        continuity.step_q16 = (uint32_t)desired_q16;
    }
    else if ((uint32_t)desired_q16 < continuity.step_q16)
    {
        continuity.step_q16 =
            (continuity.step_q16 + (uint32_t)desired_q16) / 2u;
    }
    else
    {
        continuity.step_q16 =
            (continuity.step_q16 * 7u + (uint32_t)desired_q16) / 8u;
    }
}

#ifdef BSP_RETRO_GO_AUDIO_WSOLA
static void wsola_copy_source(int16_t *destination,
                              uint32_t source_index,
                              uint32_t sample_count)
{
    uint32_t first = sample_count;
    uint32_t offset = source_index & RETRO_GO_AUDIO_RING_MASK;

    if (first > RETRO_GO_AUDIO_RING_SAMPLES - offset)
    {
        first = RETRO_GO_AUDIO_RING_SAMPLES - offset;
    }
    memcpy(destination, &audio_ring[offset], first * sizeof(destination[0]));
    if (sample_count > first)
    {
        memcpy(destination + first, audio_ring,
               (sample_count - first) * sizeof(destination[0]));
    }
}

static bool wsola_prepare_initial_grain(void)
{
    uint32_t start = audio_read_index;

    if (audio_write_index - start < RETRO_GO_WSOLA_GRAIN_SAMPLES)
    {
        return false;
    }
    wsola_copy_source(wsola.current_grain, start,
                      RETRO_GO_WSOLA_GRAIN_SAMPLES);
    wsola.source_position_q16 = (uint64_t)start << 16u;
    wsola.current_start = start;
    wsola.next_start = start;
    wsola.hop_position = 0u;
    wsola.first_hop = true;
    wsola.next_ready = false;
    wsola.initialized = true;
    return true;
}

static bool wsola_prepare_next_grain(void)
{
    uint64_t desired_q16 = wsola.source_position_q16 +
        (uint64_t)continuity.step_q16 * RETRO_GO_WSOLA_HOP_SAMPLES;
    uint32_t desired_start = (uint32_t)(desired_q16 >> 16u);
    uint32_t search = continuity.step_q16 == RETRO_GO_AUDIO_Q16_ONE ?
        0u : RETRO_GO_WSOLA_SEARCH_SAMPLES;
    uint32_t maximum_start;
    uint32_t lower;
    uint32_t upper;
    uint32_t best_start;
    uint32_t best_score = UINT32_MAX;
    uint32_t candidate;

    if (audio_write_index - wsola.current_start <
        RETRO_GO_WSOLA_GRAIN_SAMPLES)
    {
        return false;
    }
    maximum_start = audio_write_index - RETRO_GO_WSOLA_GRAIN_SAMPLES;
    lower = desired_start > search ? desired_start - search : 0u;
    if (lower < wsola.current_start)
    {
        lower = wsola.current_start;
    }
    upper = desired_start + search;
    if (upper > maximum_start)
    {
        upper = maximum_start;
    }
    if (lower > upper)
    {
        return false;
    }
    best_start = lower;
    for (candidate = lower; candidate <= upper; ++candidate)
    {
        uint32_t score = 0u;
        uint32_t sample;

        for (sample = 0u; sample < RETRO_GO_WSOLA_HOP_SAMPLES;
             sample += RETRO_GO_WSOLA_SCORE_STRIDE)
        {
            int32_t difference =
                (int32_t)wsola.current_grain[
                    RETRO_GO_WSOLA_HOP_SAMPLES + sample] -
                (int32_t)audio_ring[
                    (candidate + sample) & RETRO_GO_AUDIO_RING_MASK];

            score += (uint32_t)(difference < 0 ?
                                -difference : difference);
        }
        if (score < best_score ||
            (score == best_score &&
             (candidate > desired_start ? candidate - desired_start :
                                           desired_start - candidate) <
             (best_start > desired_start ? best_start - desired_start :
                                            desired_start - best_start)))
        {
            best_score = score;
            best_start = candidate;
        }
    }
    wsola_copy_source(wsola.next_grain, best_start,
                      RETRO_GO_WSOLA_GRAIN_SAMPLES);
    wsola.next_start = best_start;
    /* Keep the long-term analysis clock independent from the local waveform
     * match. Accumulating best_start's +/- search correction makes the
     * effective consumption rate random-walk away from STR, which is visible
     * as a full source ring followed by a sudden drain and PLC burst. */
    wsola.source_position_q16 = desired_q16;
    audio_read_index = best_start;
    __DMB();
    wsola.next_ready = true;
    return true;
}

static bool wsola_next_sample(int16_t *sample)
{
    uint32_t position;

    if (!wsola.initialized && !wsola_prepare_initial_grain())
    {
        return false;
    }
    if (wsola.first_hop)
    {
        *sample = wsola.current_grain[wsola.hop_position++];
        if (wsola.hop_position == RETRO_GO_WSOLA_HOP_SAMPLES)
        {
            wsola.hop_position = 0u;
            wsola.first_hop = false;
        }
        return true;
    }
    if (!wsola.next_ready && !wsola_prepare_next_grain())
    {
        return false;
    }
    position = wsola.hop_position;
    *sample = (int16_t)(
        ((int32_t)wsola.current_grain[
            RETRO_GO_WSOLA_HOP_SAMPLES + position] *
             (int32_t)(RETRO_GO_WSOLA_HOP_SAMPLES - position) +
         (int32_t)wsola.next_grain[position] * (int32_t)position) /
        (int32_t)RETRO_GO_WSOLA_HOP_SAMPLES);
    ++wsola.hop_position;
    if (wsola.hop_position == RETRO_GO_WSOLA_HOP_SAMPLES)
    {
        memcpy(wsola.current_grain, wsola.next_grain,
               sizeof(wsola.current_grain));
        wsola.current_start = wsola.next_start;
        wsola.hop_position = 0u;
        wsola.next_ready = false;
    }
    return true;
}

static void wsola_fill_output_ring(void)
{
    rt_base_t level;
    uint32_t write_snapshot;
    uint32_t read_snapshot;
    uint32_t local_write;
    uint32_t buffered;

    level = rt_hw_interrupt_disable();
    write_snapshot = wsola_output_write_index;
    read_snapshot = wsola_output_read_index;
    rt_hw_interrupt_enable(level);
    local_write = write_snapshot;
    buffered = write_snapshot - read_snapshot;
    while (buffered < (uint32_t)BSP_RETRO_GO_AUDIO_OUTPUT_TARGET_SAMPLES &&
           buffered < RETRO_GO_WSOLA_OUTPUT_RING_SAMPLES)
    {
        int16_t sample;

