Rbb666/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_RetroGo/applications/retro_go/platform/retro_go_audio_pdl.c
        if (!wsola_next_sample(&sample))
        {
            break;
        }
        wsola_output_ring[local_write &
                          RETRO_GO_WSOLA_OUTPUT_RING_MASK] = sample;
        ++local_write;
        ++buffered;
    }
    if (local_write != write_snapshot)
    {
        __DMB();
        wsola_output_write_index = local_write;
    }
}
#endif

#ifndef BSP_RETRO_GO_AUDIO_WSOLA
static int16_t continuity_next_sample(void)
{
    const uint32_t fade_samples =
        (RETRO_GO_AUDIO_RATE * BSP_RETRO_GO_AUDIO_CONCEAL_FADE_MS) / 1000u;
    const int32_t fade_step =
        (32767 + (int32_t)(fade_samples != 0u ? fade_samples : 1u) - 1) /
        (int32_t)(fade_samples != 0u ? fade_samples : 1u);
    uint32_t available = audio_write_index - audio_read_index;

    if (available >= 2u)
    {
        uint32_t read_index = audio_read_index;
        int32_t first = audio_ring[read_index & RETRO_GO_AUDIO_RING_MASK];
        int32_t second =
            audio_ring[(read_index + 1u) & RETRO_GO_AUDIO_RING_MASK];
        int32_t sample = first + (int32_t)(
            ((int64_t)(second - first) *
             (int32_t)(continuity.phase_q16 & 0xffffu)) >> 16u);
        uint32_t advance;

        continuity.phase_q16 += continuity.step_q16;
        advance = continuity.phase_q16 >> 16u;
        if (advance >= available)
        {
            advance = available - 1u;
        }
        audio_read_index += advance;
        __DMB();
        continuity.phase_q16 &= 0xffffu;
        continuity.last_source_sample = (int16_t)sample;
        continuity.starving = false;
        if (continuity.gain_q15 < 32767)
        {
            continuity.gain_q15 += fade_step;
            if (continuity.gain_q15 > 32767)
            {
                continuity.gain_q15 = 32767;
            }
        }
        return continuity.gain_q15 == 32767 ? (int16_t)sample :
            (int16_t)(sample * continuity.gain_q15 / 32767);
    }

    if (!continuity.starving)
    {
        continuity.starving = true;
        ++continuity.underrun_events;
    }
    if (continuity.gain_q15 > 0)
    {
        continuity.gain_q15 -= fade_step;
        if (continuity.gain_q15 < 0)
        {
            continuity.gain_q15 = 0;
        }
    }
    ++continuity.concealed_samples;
    return (int16_t)((int32_t)continuity.last_source_sample *
                     continuity.gain_q15 / 32767);
}
#else
static int16_t continuity_next_sample(void)
{
    const uint32_t fade_samples =
        (RETRO_GO_AUDIO_RATE * BSP_RETRO_GO_AUDIO_CONCEAL_FADE_MS) / 1000u;
    const int32_t fade_step =
        (32767 + (int32_t)(fade_samples != 0u ? fade_samples : 1u) - 1) /
        (int32_t)(fade_samples != 0u ? fade_samples : 1u);

    if (wsola_output_write_index - wsola_output_read_index != 0u)
    {
        int16_t sample = wsola_output_ring[
            wsola_output_read_index & RETRO_GO_WSOLA_OUTPUT_RING_MASK];

        ++wsola_output_read_index;
        __DMB();
        continuity.last_source_sample = sample;
        continuity.starving = false;
        if (continuity.gain_q15 < 32767)
        {
            continuity.gain_q15 += fade_step;
            if (continuity.gain_q15 > 32767)
            {
                continuity.gain_q15 = 32767;
            }
        }
        return continuity.gain_q15 == 32767 ? sample :
            (int16_t)((int32_t)sample * continuity.gain_q15 / 32767);
    }
    if (!continuity.starving)
    {
        continuity.starving = true;
        ++continuity.underrun_events;
    }
    if (continuity.gain_q15 > 0)
    {
        continuity.gain_q15 -= fade_step;
        if (continuity.gain_q15 < 0)
        {
            continuity.gain_q15 = 0;
        }
    }
    ++continuity.concealed_samples;
    return (int16_t)((int32_t)continuity.last_source_sample *
                     continuity.gain_q15 / 32767);
}
#endif

static void pdl_write_mono_frames(uint32_t frame_count)
{
    uint32_t frame;

    for (frame = 0u; frame < frame_count; ++frame)
    {
        uint16_t sample = (uint16_t)continuity_next_sample();

        /* Application contract is one s16 mono sample. The generated TDM
         * link is two 16-bit slots, so place the exact same sample in L/R. */
        Cy_AudioTDM_WriteTxData(TDM_STRUCT0_TX, sample);
        Cy_AudioTDM_WriteTxData(TDM_STRUCT0_TX, sample);
    }
    audio_output_index += frame_count;
}

static void retro_go_audio_tdm_isr(void)
{
    uint32_t status;

    rt_interrupt_enter();
    status = Cy_AudioTDM_GetTxInterruptStatusMasked(TDM_STRUCT0_TX);
    if ((status & CY_TDM_INTR_TX_FIFO_TRIGGER) != 0u && audio_hw_running)
    {
        pdl_write_mono_frames(RETRO_GO_TDM_FIFO_MONO_FRAMES);
    }
    if ((status & (CY_TDM_INTR_TX_FIFO_UNDERFLOW |
                   CY_TDM_INTR_TX_IF_UNDERFLOW)) != 0u)
    {
        ++audio_hardware_underflows;
    }
    Cy_AudioTDM_ClearTxInterrupt(TDM_STRUCT0_TX, status);
    rt_interrupt_leave();
}

static bool verify_generated_tdm_contract(void)
{
    const cy_stc_tdm_config_tx_t *tx = pdl_tdm_config.tx_config;

    if (tx == NULL || !tx->enable ||
        tx->masterMode != CY_TDM_DEVICE_MASTER ||
        tx->format != CY_TDM_LEFT_DELAYED ||
        tx->clkSel != CY_TDM_SEL_SRSS_CLK0 ||
        tx->channelNum != 2u ||
        tx->channelSize != 16u || tx->wordSize != CY_TDM_SIZE_16 ||
        tx->chEn != 0x3u || tx->fifoTriggerLevel != 64u ||
        tx->clkDiv != 8u || !tx->i2sMode)
    {
        rt_kprintf("[retro-go] generated TDM contract mismatch\n");
        return false;
    }
    return true;
}

static void prepare_pdl_tdm_config(void)
{
    pdl_tdm_tx_config = CYBSP_TDM_CONTROLLER_0_tx_config;
    pdl_tdm_tx_config.clkDiv = 8u;
    pdl_tdm_config = CYBSP_TDM_CONTROLLER_0_config;
    pdl_tdm_config.tx_config = &pdl_tdm_tx_config;
}

static bool configure_exact_i2s_clock(void)
{
    const en_clk_dst_t divider_group =
        (en_clk_dst_t)CYBSP_TDM_CONTROLLER_0_CLK_DIV_GRP_NUM;
    uint32_t readback[2] __attribute__((aligned(32))) = {0u, 0u};
    uint32_t mclk_hz;
    uint32_t bclk_hz;
    uint32_t lrck_hz;
    cy_en_sysclk_status_t status;

    status = Cy_SysClk_PeriPclkDisableDivider(
        divider_group, CY_SYSCLK_DIV_16_5_BIT, 0u);
    if (status == CY_SYSCLK_SUCCESS)
    {
        status = Cy_SysClk_PeriPclkSetFracDivider(
            divider_group, CY_SYSCLK_DIV_16_5_BIT, 0u, 11u, 0u);
    }
    if (status == CY_SYSCLK_SUCCESS)
    {
        status = Cy_SysClk_PeriPclkEnableDivider(
            divider_group, CY_SYSCLK_DIV_16_5_BIT, 0u);
    }
    if (status != CY_SYSCLK_SUCCESS)
    {
        return false;
    }
    Cy_SysClk_PeriPclkGetFracDivider(
        divider_group, CY_SYSCLK_DIV_16_5_BIT, 0u,
        &readback[0], &readback[1]);
    mclk_hz = Cy_SysClk_PeriPclkGetFrequency(
        divider_group, CY_SYSCLK_DIV_16_5_BIT, 0u);
    bclk_hz = mclk_hz / pdl_tdm_tx_config.clkDiv;
    lrck_hz = bclk_hz /
        ((uint32_t)pdl_tdm_tx_config.channelNum *
         (uint32_t)pdl_tdm_tx_config.channelSize);
    rt_kprintf("[retro-go] PDL I2S clock: divider=%u+%u/32 (/12), "
               "MCLK=%u Hz BCLK=%u Hz LRCK=%u Hz\n",
               (unsigned)readback[0], (unsigned)readback[1],
               (unsigned)mclk_hz, (unsigned)bclk_hz, (unsigned)lrck_hz);
    return readback[0] == 11u && readback[1] == 0u &&
           mclk_hz == 4096000u && bclk_hz == 512000u &&
           lrck_hz == RETRO_GO_AUDIO_RATE;
}

static bool pdl_audio_start(void)
{
    rt_base_t level;

