Rbb666/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_RetroGo/applications/retro_go/platform/retro_go_audio_pdl.c
    if (audio_hw_running)
    {
        return true;
    }
    level = rt_hw_interrupt_disable();
    audio_hw_running = true;
    /* Keep the trigger masked while the empty FIFO is enabled and primed.
     * Otherwise an empty-FIFO edge can remain pending and cause the ISR to
     * append another 64 words after the 128-word startup fill. */
    Cy_AudioTDM_SetTxInterruptMask(TDM_STRUCT0_TX, 0u);
    Cy_AudioTDM_ClearTxInterrupt(TDM_STRUCT0_TX, CY_TDM_INTR_TX_MASK);
    NVIC_ClearPendingIRQ(CYBSP_TDM_CONTROLLER_0_TX_IRQ);
    Cy_AudioTDM_EnableTx(TDM_STRUCT0_TX);
    pdl_write_mono_frames(RETRO_GO_TDM_STARTUP_MONO_FRAMES);
    Cy_AudioTDM_ClearTxInterrupt(TDM_STRUCT0_TX, CY_TDM_INTR_TX_MASK);
    NVIC_ClearPendingIRQ(CYBSP_TDM_CONTROLLER_0_TX_IRQ);
    Cy_AudioTDM_SetTxInterruptMask(
        TDM_STRUCT0_TX,
        CY_TDM_INTR_TX_FIFO_TRIGGER | CY_TDM_INTR_TX_FIFO_UNDERFLOW |
        CY_TDM_INTR_TX_IF_UNDERFLOW);
    Cy_AudioTDM_ActivateTx(TDM_STRUCT0_TX);
    rt_hw_interrupt_enable(level);
    return true;
}

bool retro_go_audio_init(void)
{
    cy_stc_sysint_t interrupt_config =
    {
        .intrSrc = CYBSP_TDM_CONTROLLER_0_TX_IRQ,
        .intrPriority = 2u,
    };

    if (audio_ready)
    {
        return true;
    }
    prepare_pdl_tdm_config();
    if (!verify_generated_tdm_contract() || !configure_exact_i2s_clock())
    {
        return false;
    }
    if (Cy_SysInt_Init(&interrupt_config, retro_go_audio_tdm_isr) !=
        CY_SYSINT_SUCCESS)
    {
        rt_kprintf("[retro-go] PDL TDM interrupt setup failed\n");
        return false;
    }
    if (Cy_AudioTDM_Init(TDM_STRUCT0, &pdl_tdm_config) !=
        CY_TDM_SUCCESS)
    {
        rt_kprintf("[retro-go] PDL TDM init failed\n");
        return false;
    }
    Cy_AudioTDM_SetTxInterruptMask(TDM_STRUCT0_TX, 0u);
    Cy_AudioTDM_ClearTxInterrupt(TDM_STRUCT0_TX, CY_TDM_INTR_TX_MASK);
    NVIC_ClearPendingIRQ(CYBSP_TDM_CONTROLLER_0_TX_IRQ);
    NVIC_EnableIRQ(CYBSP_TDM_CONTROLLER_0_TX_IRQ);

    if (es8388_init("i2c0", RT_NULL) != RT_EOK)
    {
        NVIC_DisableIRQ(CYBSP_TDM_CONTROLLER_0_TX_IRQ);
        Cy_AudioTDM_DeInit(TDM_STRUCT0);
        rt_kprintf("[retro-go] ES8388 direct-PDL init failed\n");
        return false;
    }
    if (es8388_start(ES_MODE_DAC) != RT_EOK)
    {
        (void)es8388_stop(ES_MODE_DAC);
        NVIC_DisableIRQ(CYBSP_TDM_CONTROLLER_0_TX_IRQ);
        Cy_AudioTDM_DeInit(TDM_STRUCT0);
        rt_kprintf("[retro-go] ES8388 direct-PDL start failed\n");
        return false;
    }
    es8388_volume_set(70u);

    audio_write_index = 0u;
    audio_read_index = 0u;
    audio_source_index = 0u;
    audio_output_index = 0u;
    audio_hardware_underflows = 0u;
    audio_overflow_reported = false;
    audio_playback_started = false;
    audio_hw_running = false;
    memset(&continuity, 0, sizeof(continuity));
#ifdef BSP_RETRO_GO_AUDIO_WSOLA
    memset(&wsola, 0, sizeof(wsola));
    wsola_output_write_index = 0u;
    wsola_output_read_index = 0u;
#endif
    continuity.phase_q16 = 0u;
    continuity.step_q16 = RETRO_GO_AUDIO_Q16_ONE;
    continuity.feedforward_q16 = RETRO_GO_AUDIO_Q16_ONE;
    continuity.gain_q15 = 32767;
    continuity.control_started_ms = rt_tick_get_millisecond();
    audio_ready = true;
    rt_kprintf("[retro-go] PDL audio ready: input channels=1 mono s16, "
               "TDM=2x16 dual-mono MCLK=256fs, FIFO=%u frames, "
               "ring=%u, preroll=%u"
#ifdef BSP_RETRO_GO_AUDIO_WSOLA
               ", WSOLA=%u/%u search=+-%u out-target=%u"
#endif
               "\n",
               RETRO_GO_TDM_FIFO_MONO_FRAMES,
               RETRO_GO_AUDIO_RING_SAMPLES,
               BSP_RETRO_GO_AUDIO_PREROLL_SAMPLES
#ifdef BSP_RETRO_GO_AUDIO_WSOLA
               , RETRO_GO_WSOLA_GRAIN_SAMPLES,
               RETRO_GO_WSOLA_HOP_SAMPLES,
               RETRO_GO_WSOLA_SEARCH_SAMPLES,
               BSP_RETRO_GO_AUDIO_OUTPUT_TARGET_SAMPLES
#endif
               );
    return true;
}

void retro_go_audio_submit(const int16_t *samples, size_t sample_count)
{
    rt_base_t level;
    uint32_t write_snapshot;
    uint32_t read_snapshot;
    uint32_t used;
    size_t free_samples;
    size_t accepted;
    size_t first;
    bool start_playback = false;
    bool report_overflow = false;

    if (!audio_ready || samples == NULL || sample_count == 0u)
    {
        return;
    }
    level = rt_hw_interrupt_disable();
    write_snapshot = audio_write_index;
    read_snapshot = audio_read_index;
    rt_hw_interrupt_enable(level);
    used = write_snapshot - read_snapshot;
    free_samples = RETRO_GO_AUDIO_RING_SAMPLES - used;
    accepted = sample_count < free_samples ? sample_count : free_samples;
    first = accepted;
    if (first > RETRO_GO_AUDIO_RING_SAMPLES -
                    (write_snapshot & RETRO_GO_AUDIO_RING_MASK))
    {
        first = RETRO_GO_AUDIO_RING_SAMPLES -
                (write_snapshot & RETRO_GO_AUDIO_RING_MASK);
    }
    if (first != 0u)
    {
        memcpy(&audio_ring[write_snapshot & RETRO_GO_AUDIO_RING_MASK],
               samples, first * sizeof(samples[0]));
    }
    if (accepted > first)
    {
        memcpy(audio_ring, samples + first,
               (accepted - first) * sizeof(samples[0]));
    }
    __DMB();
    level = rt_hw_interrupt_disable();
    if (audio_source_index == 0u)
    {
        continuity.control_started_ms = rt_tick_get_millisecond();
        continuity.control_source_index = (uint32_t)sample_count;
        continuity.control_output_index = 0u;
    }
    audio_source_index += (uint32_t)sample_count;
    audio_write_index = write_snapshot + (uint32_t)accepted;
#ifndef BSP_RETRO_GO_AUDIO_WSOLA
    if (!audio_playback_started &&
        (audio_write_index - audio_read_index) >=
            BSP_RETRO_GO_AUDIO_PREROLL_SAMPLES)
    {
        audio_playback_started = true;
        start_playback = true;
    }
#endif
    if (accepted != sample_count && !audio_overflow_reported)
    {
        audio_overflow_reported = true;
        report_overflow = true;
    }
    rt_hw_interrupt_enable(level);

    continuity_update_control();
#ifdef BSP_RETRO_GO_AUDIO_WSOLA
    wsola_fill_output_ring();
    level = rt_hw_interrupt_disable();
    if (!audio_playback_started &&
        (wsola_output_write_index - wsola_output_read_index) >=
            BSP_RETRO_GO_AUDIO_PREROLL_SAMPLES)
    {
        audio_playback_started = true;
        start_playback = true;
    }
    rt_hw_interrupt_enable(level);
#endif
    if (start_playback)
    {
        (void)pdl_audio_start();
    }
    if (report_overflow)
    {
        rt_kprintf("[retro-go] PDL audio ring overrun; dropped=%u samples\n",
                   (unsigned)(sample_count - accepted));
    }
}

