Rbb666/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_RetroGo/applications/retro_go/platform/retro_go_audio_pdl.c
size_t retro_go_audio_buffered_samples(void)
{
    rt_base_t level = rt_hw_interrupt_disable();
#ifdef BSP_RETRO_GO_AUDIO_WSOLA
    size_t result = audio_ready ?
        (size_t)(wsola_output_write_index - wsola_output_read_index) : 0u;
#else
    size_t result = audio_ready ?
        (size_t)(audio_write_index - audio_read_index) : 0u;
#endif

    rt_hw_interrupt_enable(level);
    return result;
}

uint32_t retro_go_audio_submitted_samples(void)
{
    rt_base_t level = rt_hw_interrupt_disable();
#ifdef BSP_RETRO_GO_AUDIO_WSOLA
    uint32_t result = wsola_output_write_index;
#else
    uint32_t result = audio_write_index;
#endif

    rt_hw_interrupt_enable(level);
    return result;
}

void retro_go_audio_get_stats(retro_go_audio_stats_t *stats)
{
    rt_base_t level;
    uint32_t available;
    uint32_t step_q16;
#ifdef BSP_RETRO_GO_AUDIO_WSOLA
    uint32_t output_available;
#endif

    if (stats == NULL)
    {
        return;
    }
    memset(stats, 0, sizeof(*stats));
    level = rt_hw_interrupt_disable();
    available = audio_ready ? audio_write_index - audio_read_index : 0u;
    step_q16 = continuity.step_q16 != 0u ?
        continuity.step_q16 : RETRO_GO_AUDIO_Q16_ONE;
    stats->source_buffer_samples = available;
    stats->input_rate_hz = continuity.input_rate_hz;
    stats->output_rate_hz = continuity.output_rate_hz;
    stats->concealed_samples = continuity.concealed_samples;
    stats->underrun_events = continuity.underrun_events;
    stats->hardware_underflows = audio_hardware_underflows;
#ifdef BSP_RETRO_GO_AUDIO_WSOLA
    output_available = wsola_output_write_index - wsola_output_read_index;
    stats->output_buffer_samples = output_available;
#endif
    rt_hw_interrupt_enable(level);
    stats->stretch_permille =
        (uint32_t)(((uint64_t)step_q16 * 1000u) >> 16u);
    stats->source_buffer_ms = step_q16 != 0u ?
        (uint32_t)(((uint64_t)available * 1000u *
                    RETRO_GO_AUDIO_Q16_ONE) /
                   ((uint64_t)RETRO_GO_AUDIO_RATE * step_q16)) : 0u;
#ifdef BSP_RETRO_GO_AUDIO_WSOLA
    stats->output_buffer_ms =
        (uint32_t)(((uint64_t)output_available * 1000u) /
                   RETRO_GO_AUDIO_RATE);
#endif
}

void retro_go_audio_deinit(void)
{
    rt_base_t level;
    bool was_running;

    if (!audio_ready)
    {
        return;
    }

    level = rt_hw_interrupt_disable();
    was_running = audio_hw_running;
    audio_ready = false;
    audio_hw_running = false;
    Cy_AudioTDM_SetTxInterruptMask(TDM_STRUCT0_TX, 0u);
    NVIC_DisableIRQ(CYBSP_TDM_CONTROLLER_0_TX_IRQ);
    NVIC_ClearPendingIRQ(CYBSP_TDM_CONTROLLER_0_TX_IRQ);
    rt_hw_interrupt_enable(level);
    if (was_running)
    {
        Cy_AudioTDM_DeActivateTx(TDM_STRUCT0_TX);
        Cy_AudioTDM_DisableTx(TDM_STRUCT0_TX);
    }
    audio_playback_started = false;
    Cy_AudioTDM_ClearTxInterrupt(TDM_STRUCT0_TX, CY_TDM_INTR_TX_MASK);
    Cy_AudioTDM_DeInit(TDM_STRUCT0);
    (void)es8388_stop(ES_MODE_DAC);
}
